tutorials/incompressible/simpleSolver/GeorgiaTechRotorSource/0/k
/*---------------------------------------------------------------------------*\
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00375;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00375;
        value           uniform 0.00375;
    }
    wall-body
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    wall-tunnel
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
}


// ************************************************************************* //
