tutorials/incompressible/simpleSolver/GeorgiaTechRotorSource/0/p
/*---------------------------------------------------------------------------*\
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    wall-body
    {
        type            zeroGradient;
    }
    wall-tunnel
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
