tutorials/incompressible/simpleSolver/GeorgiaTechRotorSource/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       1004405;
    }
    outlet
    {
        type            patch;
        nFaces          164;
        startFace       1004555;
    }
    wall-body
    {
        type            wall;
        nFaces          2732;
        startFace       1004719;
    }
    wall-tunnel
    {
        type            wall;
        nFaces          1162;
        startFace       1007451;
    }
)

// ************************************************************************* //
