tutorials/incompressible/simpleSolver/GeorgiaTechRotorSource/system/fvOptions
/*---------------------------------------------------------------------------*\
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mainrotor
{
    type            rotorDisk;
    active          on;
    timeStart       0.0;
    duration        100000.0;
    selectionMode   cellZone;
    cellZone        fluid-rot;

    rotorDiskCoeffs
    {
        fieldNames      (U);

        rhoName         none;
        rhoRef          1.225;

        rotorDebugMode  false;
	    rotorURF	    1.0;

        geometryMode    auto;
        refDirection    (-1 0 0);
        pointAbove      (0 0 2);

        rpm             2100;

        nBlades         2;
        inletFlowType   local;
        tipEffect       1;

        flapCoeffs
        {
            beta0       0;
            beta1c      0;
            beta1s      0;
        }

        trimModel       fixedTrim;   //targetCoeffTrim;

        fixedTrimCoeffs
        {
            theta0      10;
            theta1c     0;
            theta1s     0;
        }

        targetCoeffTrimCoeffs
        {
            target
            {
		        useCoeffs   false;
                thrust      72.8;
                roll        0;
                pitch       0;
            }

            pitchAngles
            { 
                theta0Ini	9;
                theta1cIni	0;
                theta1sIni	0;
            }
            calcFrequency   100;
   	        nIter	        50;
	        tol		        1e-06;
            dTheta          0.05;
            relax           0.5;
  	        alpha	        1.0;
        }

        blade
        {   //    (profileName (radius twist chord))
            data
            (
                (NACA0015   (       0 0 0.086))
                (NACA0015   (0.456978 0 0.086))
            );
        }

        profiles
        {
            NACA0015
            {
                type            lookup;
                data
                ( //  alpha    Cd      Cl   
	            ( -180	0.02   0	)
	            ( -175	0.06   0.49	)
	            ( -170	0.13   0.75	)
	            ( -165	0.24   0.68	)
	            ( -160	0.3	   0.65	)
	            ( -140	1.04   1	)
	            ( -120	1.65   0.75	)
	            ( -110	1.85   0.48	)
	            ( -100	2.02   0.21	)
	            ( -90	2.02  -0.06	)
	            ( -80	1.96  -0.34	)
        	    ( -70	1.84  -0.61	)
        	    ( -60	1.66  -0.88	)
	            ( -50	1.39  -1.15	)
	            ( -30	0.56  -0.98	)
	            ( -20	0.35  -0.75	)
	            ( -19	0.28  -0.76	)
	            ( -18	0.21  -0.77	)
	            ( -17	0.17  -0.78	)
	            ( -16	0.15  -0.79	)
	            ( -15	0.14  -0.83	)
	            ( -14	0.14  -0.86	)
	            ( -13	0.1	  -0.93	)
	            ( -12	0.04  -1	)
	            ( -11	0.02  -0.99	)
	            ( -10	0.02  -0.94	)
	            ( -9	0.02  -0.87	)
	            ( -8	0.02  -0.79	)
	            ( -7	0.01  -0.7	)
	            ( -6	0.01  -0.61	)
	            ( -5	0.01  -0.52	)
	            ( -4	0.01  -0.43	)
	            ( -3	0.01  -0.32	)
	            ( -2	0.01  -0.22	)
	            ( -1	0.01  -0.11	)
	            (  0	0.01   0	)
	            (  1	0.01   0.11	)
	            (  2	0.01   0.22	)
	            (  3	0.01   0.32	)
	            (  4	0.01   0.43	)
	            (  5	0.01   0.52	)
	            (  6	0.01   0.61	)
	            (  7	0.01   0.7	)
        	    (  8	0.02   0.79	)
	            (  9	0.02   0.87	)
        	    (  10	0.02   0.94	)
        	    (  11	0.02   0.99	)
        	    (  12	0.04   1	)
	            (  13	0.1	   0.93	)
	            (  14	0.14   0.86	)
	            (  15	0.14   0.83	)
	            (  16	0.15   0.79	)
	            (  17	0.17   0.78	)
	            (  18	0.21   0.77	)
	            (  19	0.28   0.76	)
	            (  20	0.35   0.75	)
	            (  30	0.56   0.98	)
	            (  50	1.39   1.15	)
	            (  60	1.66   0.88	)
	            (  70	1.84   0.61	)
	            (  80	1.96   0.34	)
	            (  90	2.02   0.06	)
	            (  100	2.02  -0.21	)
	            (  110	1.85  -0.48	)
	            (  120	1.65  -0.75	)
	            (  140	1.04  -1	)
	            (  160	0.3	  -0.65	)
	            (  165	0.24  -0.68	)
	            (  170	0.13  -0.75	)
	            (  175	0.06  -0.49	)
	            (  180	0.02   0	)
                );
            }
        }
    }
}

// *********************************************************************** //

